<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Widget Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the messages used by widgets.
    | Feel free to tweak each of these messages here.
    |
    */

    //'user' => 'Пользователь',

    'btn' => [
        'show' => 'Показать',
        'edit' => 'Редактировать',
        'delete' => 'Удалить',
        //'create' => 'Создать',
        //'store' => 'Сохранить',
        //'update' => 'Обновить',
        //'restore' => 'Восстановить',
        //'erise' => 'Уничтожить',
    ],

    'title_create' => 'Новый пользователь',
    'header_create' => 'Новый пользователь',
    'button_create' => 'Добавить пользователя',

    'title_edit' => 'Педактирование пользователя',
    'header_edit' => 'Педактирование пользователя:',
    'button_edit' => 'Сохранить изменения',

    'title_index' => 'Пользователи',
    'header_index' => 'Пользователи',
    'add_user' => 'Добавить нового пользователи',
    'empty' => 'Нет пользователей',

    'profile' => 'Профиль пользователя',
    'articles' => 'Статьи пользователя',
    'comments' => 'Комментарии пользователя',

    'created_at' => 'Дата регистрации:',
    'role' => 'Роль:',
    'info' => 'Дополнительная информация:',

    'error' => 'Произошла ошибка при обработка запроса.',
    'name_label' => 'Имя:',
    'name_help' => 'Имя обязательно и должно быть длиной менее 256 символов.',
    'info_label' => 'Дополнительная информация:',
    'info_help' => 'Расскажите нам что-нибудь о себе.',
    'role_label' => 'Роль:',
    'role_help' => 'Роль пользователя.',

    'roles' => [
        'banned' => 'Заблокированный пользователь',
        'user' => 'Обычный пользователь',
        'moderator' => 'Модератор',
        'admin' => 'Администратор',
    ],

];
